app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

    <%= link_to (pluralize post.comments.count, "comment"), post_comments_path(post) %>