app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["post_id", 1], ["content", nil], ["created_at", "2024-01-15 20:19:31.989884"], ["updated_at", "2024-01-15 20:19:31.989884"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "updated_at" = ? WHERE "comments"."id" = ?  [["updated_at", "2024-01-16 17:31:29.452309"], ["id", 5]]

  def destroy
    @comment.destroy!
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]

  def get_post
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_comment
      @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 5], ["LIMIT", 1]]