app/controllers/posts_controller.rb

INSERT INTO "posts" ("post_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["post_name", "2024 United States presidential election"], ["description", nil], ["created_at", "2024-01-15 15:25:26.945621"], ["updated_at", "2024-01-15 15:25:26.945621"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save